In [1]:
import seaborn as sns
DF = sns.load_dataset('titanic')

DF.head(10)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True
5         0       3    male   NaN  ...   NaN   Queenstown     no   True
6         0       1    male  54.0  ...     E  Southampton     no   True
7         0       3    male   2.0  ...   NaN  Southampton     no  False
8         1       3  female  27.0  ...   NaN  Southampton    yes  False
9         1       2  female  14.0  ...   NaN    Cherbourg    yes  False

[10 rows x 15 columns]

In [2]:
DF.shape

(891, 15)

In [3]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [4]:
DF.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [5]:
DF['deck'].value_counts(dropna=False)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [6]:
DF.head(10).isnull()

   survived  pclass    sex    age  ...   deck  embark_town  alive  alone
0     False   False  False  False  ...   True        False  False  False
1     False   False  False  False  ...  False        False  False  False
2     False   False  False  False  ...   True        False  False  False
3     False   False  False  False  ...  False        False  False  False
4     False   False  False  False  ...   True        False  False  False
5     False   False  False   True  ...   True        False  False  False
6     False   False  False  False  ...  False        False  False  False
7     False   False  False  False  ...   True        False  False  False
8     False   False  False  False  ...   True        False  False  False
9     False   False  False  False  ...   True        False  False  False

[10 rows x 15 columns]

In [7]:
DF.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [8]:
DF.head(10).notnull

<bound method DataFrame.notnull of    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True
5         0       3    male   NaN  ...   NaN   Queenstown     no   True
6         0       1    male  54.0  ...     E  Southampton     no   True
7         0       3    male   2.0  ...   NaN  Southampton     no  False
8         1       3  female  27.0  ...   NaN  Southampton    yes  False
9         1       2  female  14.0  ...   NaN    Cherbourg    yes  False

[10 rows x 15 columns]>

In [9]:
DF.isnull().sum(axis=1)

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

In [15]:
DF.dropna(thresh=300, axis=1).shape

(891, 14)

In [16]:
DF.dropna(subset=['age'],how='any',axis=0).shape

(714, 15)

In [17]:
DF['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [19]:
DF['age'].fillna(int(DF['age'].mean(axis=0)), inplace=True)

In [20]:
DF['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    29.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [21]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

In [22]:
most_freq = DF['embark_town'].value_counts(dropna=True).idxmax()
most_freq

'Southampton'

In [24]:
DF['embark_town'].fillna(most_freq, inplace=True)

In [25]:
DF['embark_town'][825:830]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [26]:
DF = sns.load_dataset('titanic')
DF['embark_town'][828:831]

828    Queenstown
829           NaN
830     Cherbourg
Name: embark_town, dtype: object

In [27]:
DF['embark_town'].fillna(method='ffill', inplace=True)

In [28]:
DF['embark_town'][828:831]

828    Queenstown
829    Queenstown
830     Cherbourg
Name: embark_town, dtype: object

In [29]:
DF =sns.load_dataset('titanic')
DF['embark_town'][828:831]

828    Queenstown
829           NaN
830     Cherbourg
Name: embark_town, dtype: object

In [30]:
DF['embark_town'].fillna(method='bfill', inplace=True)

In [31]:
DF['embark_town'][828:831]

828    Queenstown
829     Cherbourg
830     Cherbourg
Name: embark_town, dtype: object

In [33]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF= titanic.loc[:,['age','fare']].head(5)
DF

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [34]:
DF.apply(sum, axis=0)

age     156.0000
fare    147.6083
dtype: float64

In [35]:
DF.apply(sum, axis=1)

0     29.2500
1    109.2833
2     33.9250
3     88.1000
4     43.0500
dtype: float64

In [36]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

titanic.head(3)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]

In [38]:
Filter_1 = (titanic.age >=10) & (titanic.age<20)
titanic.loc[Filter_1, :].head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
9          1       2  female  14.0  ...   NaN    Cherbourg    yes  False
14         0       3  female  14.0  ...   NaN  Southampton     no   True
22         1       3  female  15.0  ...   NaN   Queenstown    yes   True
27         0       1    male  19.0  ...     C  Southampton     no  False
38         0       3  female  18.0  ...   NaN  Southampton     no  False

[5 rows x 15 columns]

In [39]:
Filter_2 = (titanic.age<10)& (titanic.sex =='female')
titanic.loc[Filter_2,:].head()

     survived  pclass     sex  age  ...  deck  embark_town  alive  alone
10          1       3  female  4.0  ...     G  Southampton    yes  False
24          0       3  female  8.0  ...   NaN  Southampton     no  False
43          1       2  female  3.0  ...   NaN    Cherbourg    yes  False
58          1       2  female  5.0  ...   NaN  Southampton    yes  False
119         0       3  female  2.0  ...   NaN  Southampton     no  False

[5 rows x 15 columns]

In [43]:
Filter_3=(titanic.age<10)|(titanic.age>=60)
titanic.loc[Filter_3,['age','sex','alone']].head()

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

In [44]:
Filter_isin = titanic['sibsp'].isin([3,4,5])
titanic[Filter_isin].head(6)

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
7          0       3    male   2.0  ...   NaN  Southampton     no  False
16         0       3    male   2.0  ...   NaN   Queenstown     no  False
24         0       3  female   8.0  ...   NaN  Southampton     no  False
27         0       1    male  19.0  ...     C  Southampton     no  False
50         0       3    male   7.0  ...   NaN  Southampton     no  False
59         0       3    male  11.0  ...   NaN  Southampton     no  False

[6 rows x 15 columns]

In [45]:
import pandas as pd
DF1 = pd.DataFrame({'hp':['hp1','hp2','hp3','hp4'],
                    'ibm':['ibm1','ibm2','ibm3','ibm4'],
                    'dell':['dell1','dell2','dell3','dell4']},
                   index=[0,1,2,3])
DF1

    hp   ibm   dell
0  hp1  ibm1  dell1
1  hp2  ibm2  dell2
2  hp3  ibm3  dell3
3  hp4  ibm4  dell4

In [51]:
DF2=pd.DataFrame({'hp':['hp3','hp4','hp5','hp6'],
                  'ibm':['ibm3','ibm4','ibm5','ibm6'],
                  'dell':['dell3','dell4','dell5','dell6'],
                  'asus':['asus3','asus4','asus5','asus6']},
                 index=[2,3,4,5])
DF2

    hp   ibm   dell   asus
2  hp3  ibm3  dell3  asus3
3  hp4  ibm4  dell4  asus4
4  hp5  ibm5  dell5  asus5
5  hp6  ibm6  dell6  asus6

In [52]:
pd.concat([DF1,DF2],axis=0)

    hp   ibm   dell   asus
0  hp1  ibm1  dell1    NaN
1  hp2  ibm2  dell2    NaN
2  hp3  ibm3  dell3    NaN
3  hp4  ibm4  dell4    NaN
2  hp3  ibm3  dell3  asus3
3  hp4  ibm4  dell4  asus4
4  hp5  ibm5  dell5  asus5
5  hp6  ibm6  dell6  asus6

In [53]:
pd.concat([DF1,DF2], axis=0, ignore_index=True)

    hp   ibm   dell   asus
0  hp1  ibm1  dell1    NaN
1  hp2  ibm2  dell2    NaN
2  hp3  ibm3  dell3    NaN
3  hp4  ibm4  dell4    NaN
4  hp3  ibm3  dell3  asus3
5  hp4  ibm4  dell4  asus4
6  hp5  ibm5  dell5  asus5
7  hp6  ibm6  dell6  asus6

In [54]:
pd.concat([DF1,DF2],axis=1, join='inner')

    hp   ibm   dell   hp   ibm   dell   asus
2  hp3  ibm3  dell3  hp3  ibm3  dell3  asus3
3  hp4  ibm4  dell4  hp4  ibm4  dell4  asus4

In [55]:
pd.concat([DF1,DF2], axis=1, join='outer')

    hp   ibm   dell   hp   ibm   dell   asus
0  hp1  ibm1  dell1  NaN   NaN    NaN    NaN
1  hp2  ibm2  dell2  NaN   NaN    NaN    NaN
2  hp3  ibm3  dell3  hp3  ibm3  dell3  asus3
3  hp4  ibm4  dell4  hp4  ibm4  dell4  asus4
4  NaN   NaN    NaN  hp5  ibm5  dell5  asus5
5  NaN   NaN    NaN  hp6  ibm6  dell6  asus6

In [56]:
pd.merge(DF1,DF2)

    hp   ibm   dell   asus
0  hp3  ibm3  dell3  asus3
1  hp4  ibm4  dell4  asus4

In [57]:
pd.merge(DF1,DF2, how='outer')

    hp   ibm   dell   asus
0  hp1  ibm1  dell1    NaN
1  hp2  ibm2  dell2    NaN
2  hp3  ibm3  dell3  asus3
3  hp4  ibm4  dell4  asus4
4  hp5  ibm5  dell5  asus5
5  hp6  ibm6  dell6  asus6

In [58]:
pd.merge(DF1,DF2, how='left')

    hp   ibm   dell   asus
0  hp1  ibm1  dell1    NaN
1  hp2  ibm2  dell2    NaN
2  hp3  ibm3  dell3  asus3
3  hp4  ibm4  dell4  asus4

In [59]:
pd.merge(DF1,DF2, how='right')

    hp   ibm   dell   asus
0  hp3  ibm3  dell3  asus3
1  hp4  ibm4  dell4  asus4
2  hp5  ibm5  dell5  asus5
3  hp6  ibm6  dell6  asus6

In [60]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

DF = titanic.loc[:,['age','sex','class','fare','survived']]
DF.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

In [61]:
grouped = DF.groupby(['class'])
grouped

In [64]:
for key in ['First','Second','Third']:
  print(grouped.get_group(key).head(3))
  print('\n')

    age     sex  class     fare  survived
1  38.0  female  First  71.2833         1
3  35.0  female  First  53.1000         1
6  54.0    male  First  51.8625         0


     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
17   NaN    male  Second  13.0000         1


    age     sex  class   fare  survived
0  22.0    male  Third  7.250         0
2  26.0  female  Third  7.925         1
4  35.0    male  Third  8.050         0

In [65]:
grouped.mean()

              age       fare  survived
class
First   38.233441  84.154687  0.629630
Second  29.877630  20.662183  0.472826
Third   25.140620  13.675550  0.242363

In [66]:
grouped.get_group('Third').head(3)

    age     sex  class   fare  survived
0  22.0    male  Third  7.250         0
2  26.0  female  Third  7.925         1
4  35.0    male  Third  8.050         0

In [67]:
group_TWO=DF.groupby(['class','sex'])

In [68]:
group_TWO

In [69]:
for key, group in group_TWO:
  print('*key :', key)
  print('*number : ', len(group))
  print(group.head(3))
  print('\n')

*key : ('First', 'female')
*number :  94
     age     sex  class     fare  survived
1   38.0  female  First  71.2833         1
3   35.0  female  First  53.1000         1
11  58.0  female  First  26.5500         1


*key : ('First', 'male')
*number :  122
     age   sex  class      fare  survived
6   54.0  male  First   51.8625         0
23  28.0  male  First   35.5000         1
27  19.0  male  First  263.0000         0


*key : ('Second', 'female')
*number :  76
     age     sex   class     fare  survived
9   14.0  female  Second  30.0708         1
15  55.0  female  Second  16.0000         1
41  27.0  female  Second  21.0000         0


*key : ('Second', 'male')
*number :  108
     age   sex   class  fare  survived
17   NaN  male  Second  13.0         1
20  35.0  male  Second  26.0         0
21  34.0  male  Second  13.0         1


*key : ('Third', 'female')
*number :  144
     age     sex  class     fare  survived
2   26.0  female  Third   7.9250         1
8   27.0  female  Third  11.1333         1
10   4.0  female  Third  16.7000         1


*key : ('Third', 'male')
*number :  347
    age   sex  class    fare  survived
0  22.0  male  Third  7.2500         0
4  35.0  male  Third  8.0500         0
5   NaN  male  Third  8.4583         0

In [71]:
group_TWO.mean()

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

In [73]:
group_TWO.get_group(('First','female')).head()

     age     sex  class      fare  survived
1   38.0  female  First   71.2833         1
3   35.0  female  First   53.1000         1
11  58.0  female  First   26.5500         1
31   NaN  female  First  146.5208         1
52  49.0  female  First   76.7292         1